# GetExternalResourceReference Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
Element..::..GetExternalResourceReference Method
Element Class See Also
---
Gets the ExternalResourceReference associated with a specified external resource type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ExternalResourceReference GetExternalResourceReference(
	ExternalResourceType resourceType
)
```

Visual Basic
---
```text
Public Function GetExternalResourceReference ( _
	resourceType As ExternalResourceType _
) As ExternalResourceReference
```

Visual C++
---
```text
public:
ExternalResourceReference^ GetExternalResourceReference(
	ExternalResourceType^ resourceType
)
```

# ### Parameters
resourceType
    Type: Autodesk.Revit.DB..::..ExternalResourceType The desired external resource type.
# ### Return Value
The copy of the ExternalResourceReference associated with a specified external resource type.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | This Element does not use a resource reference for the specified resource type. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Element Class
Autodesk.Revit.DB Namespace